app/controllers/chats_controller.rb

INSERT INTO "chats" ("project_id", "created_at", "updated_at") VALUES (16, '2026-03-06 08:14:48.324193', '2026-03-06 08:14:48.324193') RETURNING "id"
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 4 ORDER BY "messages"."created_at" ASC
---
  def show
    @chat = @project.chat || @project.create_chat!
    ensure_seed_messages!(@chat, @project)

    @messages = @chat.messages.order(:created_at)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 16 LIMIT 1
---
  def set_project
    @project = Project.find(params[:project_id])

INSERT INTO "chats" ("project_id", "created_at", "updated_at") VALUES (16, '2026-03-06 08:14:48.324193', '2026-03-06 08:14:48.324193') RETURNING "id"
---
  def ensure_seed_messages!(chat, project)
    unless chat.messages.exists?(role: "system")
      chat.messages.create!(
        role: "system",
        content: Codi::ProjectRefiner.system_prompt
      )