app/controllers/messages_controller.rb

INSERT INTO "messages" ("chat_id", "content", "created_at", "role", "updated_at") VALUES (2, 'Rempli le document', '2026-03-06 10:34:52.162977', 'user', '2026-03-06 10:34:52.162977') RETURNING "id"
UPDATE "projects" SET "full_description" = 'App Music is a music application designed to enhance user experience with music discovery and playback. - **Purpose**: To provide users with a seamless music listening experience. - **Features**: - Music streaming - Playlist creation - User recommendations - Social sharing - **Target Audience**: Music enthusiasts looking for personalized music experiences.', "updated_at" = '2026-03-06 11:33:40.078104' WHERE "projects"."id" = 8
---
  def create
    user_content = message_params[:content].to_s.strip

    if user_content.blank?
      redirect_to project_chat_path(@project), alert: "Message vide."
      return
    end

    @chat.messages.create!(role: "user", content: user_content)

    payload = Codi::ProjectRefiner.new(project: @project, chat: @chat).call

    @chat.messages.create!(
      role: "assistant",
      content: JSON.pretty_generate(payload)
    )

    project_updates = build_project_updates(payload)
    @project.update!(project_updates)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 6 LIMIT 1
---
  def set_project
    @project = Project.find(params[:project_id])