app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."status" = 1 ORDER BY "projects"."created_at" DESC
---
  def index
    @projects = Project.status_published.order(created_at: :desc)

INSERT INTO "projects" ("category", "created_at", "duration", "full_description", "level", "max_team_members", "objectives", "short_description", "status", "team_roles", "tech_stack", "timeline", "title", "updated_at") VALUES (0, '2026-03-05 13:26:58.932388', 1, 'Application pour réaliser des démos', 0, 2, NULL, 'Démo', 0, NULL, NULL, NULL, 'App Démo', '2026-03-05 13:26:58.932388') RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    @project.status = :draft

    unless @project.save

UPDATE "projects" SET "status" = 1, "updated_at" = '2026-03-06 11:11:33.104944' WHERE "projects"."id" = 8
---
  def publish
    @project.update!(status: :published)