app/services/codi/project_refiner.rb

SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 4 ORDER BY "messages"."created_at" DESC LIMIT 20
---
    def serialized_messages
      # On prend l'historique du chat, mais on limite pour éviter de grossir à l’infini
      msgs = @chat.messages.order(:created_at).last(20).map do |m|